/*
  Написать следующий скрипт:
  
    - При загрузке страницы пользователю предлагается ввести через prompt число. 
      Число введенное пользователем записывается в массив чисел.
      
    - Операция ввода числа пользователем и сохранение в массив продолжается до
      тех пор, пока пользователь не нажмет Cancel в prompt. Используйте цикл do...while.
      
    - После того как пользователь прекратил ввод нажав Cancel, необходимо взять 
      массив введенных чисел, сложить общую сумму всех элементов массива и 
      записать ее в переменную. Используйте цикл for...of.
      
    - По окончанию ввода, если массив не пустой, вывести alert с текстом `Общая сумма чисел равна ${сумма}`
      
  🔔 PS: Делать проверку того, что пользователь ввел именно число, а не произвольный набор 
      символов, не обязательно. Если хотите, в случае некорректного ввода покажите alert с текстом 
      'Было введено не число, попробуйте еще раз', при этом результат prompt записывать 
      в массив чисел не нужно, после чего снова пользователю предлагается ввести число в prompt.
*/
/*Напишите скрипт авторизации пользователя.
  
  Есть массив паролей зарегистрированных пользователей passwords. 
  
  При посещении страницы, необходимо попросить пользователя ввести свой пароль,
  после чего проверить содержит ли массив passwords пароль введенный пользователем.
  
  Пароль можно ввести не верно всего n раз, кол-во хранится в переменной attempts.
  Подсказка: используйте цикл do...while.
  Если был введен пароль который есть в массиве passwords, вывести alert 
  с текстом 'Добро пожаловать!' и прекратить спрашивать пароль в цикле.
  Если был введен не существующий пароль, отнять от лимита попыток единицу, 
  вывести alert с текстом "Неверный пароль, у вас осталось n попыток", 
  где n это оставшийся лимит. 
  
  После того как пользователь закрыл alert, запросить пароль снова. 
  Продолжать запрашивать пароль до тех пор, пока пользователь не введет 
  существующий пароль, не кончатся попытки или пока пользователь 
  не нажмет Cancel в prompt.
  Если закончились попытки, вывести alert с текстом "У вас закончились попытки, аккаунт заблокирован!"
  
  Если пользователь нажмет Cancel, прекратить выполнение цикла.
*/
"use strict";

const passwords = ['qwerty', '111qwe', '123123', 'r4nd0mp4zzw0rd'];
let attempts = 3;
let inputPasswd;

do {
  inputPasswd = prompt("Введите пароль!");
  if (inputPasswd === null) {
    alert("Отменено пользователем")
    break;
  } else if (attempts === 0) {
    alert("У вас закончились попытки! Аккаунт заблокирован!");
    break;
  } else if (passwords.includes(inputPasswd) === false) {
    attempts--;
    alert(`Пароль не верен, осталось попыток ${attempts +1}`);
  } else {
    alert("Доступ разрешен!")
    sumArr();
    break;
  }
} while (attempts != -1)

function sumArr() {
  let userInput;
  const numbers = [];
  let total = 0;
  let userNumbers;
  do {
    userInput = prompt("Введите число для масива чисел! Что бы завершить ввод нажмите ОТМЕНА");
    userNumbers = Number.parseInt(userInput);

    if (userNumbers % 1 === 0) {
      numbers.push(userNumbers);
    } else if (userInput === null) {
      alert(`Считаем сумму Вашего Масива!, Масив: ${numbers}`);
    } else {
      alert("Введите число! Символ который вы ввели не число!");
    }
  } while (userInput != null);

  for (const value of numbers) {
    total += value;
  }

  if (total === 0) {
    alert("Масив чисел пустой!");
  } else {
    alert(`Сумма всех чисел Вашего масива = ${total}`);
  }
}
